Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/index.html.txt.tmx
Source language: en
Languages: ga

source: Getting married is a big step and will significantly impact on lots of areas in your life
ga: Is céim mhór é an pósadh agus beidh tionchar suntasach aige ar a lán réimsí i do shaol

source: Find out about the legal requirements and procedures involved in getting married in Ireland and abroad
ga: Faigh eolas ar na riachtanais agus ar na gnáthaimh dhlíthiúla a bhaineann leis an bpósadh in Éirinn agus thar lear

source: Legal implications of a broken engagement
ga: Na himpleachtaí dlíthiúla a bhaineann le gealltanais bhriste

source: When an engaged couple decide not to marry, are there any implications for gifts they have jointly received?
ga: An bhfuil aon impleachtaí ann, nuair a shocraíonn beirt gan phósadh, do na brontannais a fuair siad mar bheirt?

source: What are the rules on property?
ga: Cad iad na rialacha maidir le maoin?

source: A pre-nuptial agreement is an agreement entered into by a couple before they get married
ga: Comhaontú ina n-iontrálann lánúin sula bpóstar iad is ea comhaontú réamhphósta

source: This document describes legal prerequisites that both parties must fulfil in order to have the legal capacity to marry each other
ga: Tá cur síos anseo ar na réamhriachtanais dleathúla nach mór don bheirt a chomhlíonadh le bheith in ann a chéile a phósadh

source: If they lack capacity under any heading the marriage would be void at law in Ireland
ga: Muna shásaíonn siad beirt na rialacha ar fad bheadh an pósadh neamhbhailí

source: Notification requirements for marriage
ga: Riachtanais fógartha don phósadh

source: This section outlines the notification procedure which both parties to a marriage must fulfil in order to be legally entitled to marry
ga: Tá cur síos sa chuid seo ar an bhfógra trí mhí nach mór don dá pháirtí i bpósadh a thabhairt ionas go mbeidh siad i dteideal pósadh go dlíthiúil

source: Different legal ways of getting married
ga: Bealaí dlíthiúla difriúla le bheith pósta

source: There are different ways you can get legally married in Ireland
ga: Tá bealaí difriúla inar féidir leat pósadh go dleathach in Éirinn

source: Find out about both secular and religious ceremonies that have legal effect in this country
ga: Faigh amach faoi shearmanais thuata agus reiligiúnacha le héifeacht dhlíthiúil sa tír seo

source: Religious and secular marriage ceremonies
ga: Searmanais an phósta reiligiúnacha agus saolta

source: Procedure for getting married by the rites and ceremonies of a number of different religions in Ireland
ga: Nós imeachta chun pósadh faoi dheasghnátha agus searmanais roinnt reiligiún éagsúil in Éirinn

source: (Includes information on marriage by licence, after the banns or by Registrar's Certificate)
ga: (Eolas ar phósadh le ceadúnas, tar éis na bannaí nó le Teastas an Chláraitheora i gceist ann freisin)

source: Getting married by Civil Ceremony (in a Registry Office) in Ireland, including notification of the Registrar
ga: Ag pósadh trí Shearmanas Sibhialta (in Oifig Chláraithe) in Éirinn, ina áirítear fógra a thabhairt don Chláraitheoir

source: How marriages are registered in Ireland
ga: Conas mar a chláraítear póstaí in Éirinn

source: Also refers the reader to the other sections which cover this issue in more detail
ga: Atreoraíonn sé an léitheoir chuig na rannóga a thugann níos mó sonraí faoin ábhar seo

source: Instructions on where and how to get a Marriage Certificate and costs
ga: Treoracha maidir le cén áit agus cén chaoi a bhfaighfeá Teastas Pósta agus costais

source: Information for Irish citizen(s) on how to ensure your marriage abroad is legally valid in Ireland
ga: Eolas do shaoránach/shaoránaigh Éireannacha maidir le conas a chinntiú go bhfuil do phósadh thar lear bailí de réir an dlí in Éirinn

source: Most Read in "Family and Relationships"
ga: Ábhar is mó éilimh i "Teaghlach agus Caidrimh"

source: Registrars of Births, Marriages and Deaths
ga: Leanaí agus cearta in Éirinn

source: Barring, safety and protection orders
ga: Orduithe Urchoisc, Sábháilteachta agus Cosanta
